andylee830914/esp-thread-probe/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_EXT_ADV=n
CONFIG_BT_NIMBLE_TRANSPORT_EVT_SIZE=70
CONFIG_USE_BLE_ONLY_FOR_COMMISSIONING=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
# Matter commissioning is Thread-only for this project. In the dual-MCU
# architecture, the ESP32-C6 does not run Wi-Fi station or HTTP telemetry.
# Wi-Fi and HTTP live on firmware/uplink-wroom32.
# CONFIG_ENABLE_WIFI_STATION is not set
# CONFIG_WIFI_NETWORK_COMMISSIONING_DRIVER is not set
# CONFIG_ENABLE_WIFI_TELEMETRY is not set
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_FTD=y
CONFIG_OPENTHREAD_SRP_CLIENT=y
CONFIG_OPENTHREAD_DNS_CLIENT=y
CONFIG_OPENTHREAD_HEADER_CUSTOM=y
CONFIG_OPENTHREAD_CUSTOM_HEADER_PATH="openthread_custom"
CONFIG_OPENTHREAD_CUSTOM_HEADER_FILE_NAME="openthread_config.h"
CONFIG_OPENTHREAD_LOG_LEVEL_DYNAMIC=n
# Keep OpenThread core quiet enough that duplicate MLE warnings do not starve
# Wi-Fi HTTP telemetry on small devices while still surfacing critical issues.
CONFIG_OPENTHREAD_LOG_LEVEL_CRIT=y
CONFIG_OPENTHREAD_LOG_LEVEL=1
CONFIG_OPENTHREAD_CLI=n
CONFIG_OPENTHREAD_RADIO_NATIVE=y
CONFIG_LWIP_IPV6_AUTOCONFIG=n
CONFIG_LWIP_IPV6_NUM_ADDRESSES=8
CONFIG_LWIP_MULTICAST_PING=y
CONFIG_LWIP_HOOK_IP6_ROUTE_DEFAULT=y
CONFIG_LWIP_HOOK_ND6_GET_GW_DEFAULT=y
CONFIG_ENABLE_ROUTE_HOOK=y
CONFIG_USE_MINIMAL_MDNS=n
CONFIG_ENABLE_EXTENDED_DISCOVERY=y
CONFIG_MBEDTLS_X509_CREATE_C=y
CONFIG_MBEDTLS_X509_CSR_WRITE_C=y
CONFIG_ENABLE_OTA_REQUESTOR=n
CONFIG_ENABLE_CHIP_SHELL=n
CONFIG_ENABLE_PERSIST_SUBSCRIPTIONS=n
CONFIG_MRP_LOCAL_ACTIVE_RETRY_INTERVAL_FOR_THREAD=5000
CONFIG_MRP_LOCAL_IDLE_RETRY_INTERVAL_FOR_THREAD=5000
CONFIG_MRP_RETRY_INTERVAL_SENDER_BOOST_FOR_THREAD=5000
CONFIG_MRP_MAX_RETRANS=3
CONFIG_PROBE_UPLINK_UART_ENABLE=y
CONFIG_PROBE_UPLINK_UART_NUM=1
CONFIG_PROBE_UPLINK_UART_TX_GPIO=4
CONFIG_PROBE_UPLINK_UART_RX_GPIO=5
CONFIG_PROBE_UPLINK_UART_BAUD=115200
CONFIG_PROBE_THREAD_API_LOCK_TIMEOUT_MS=0
CONFIG_PROBE_BOARD_LED_ADDRESSABLE=y
CONFIG_PROBE_BOARD_LED_GPIO_NUM=8
CONFIG_PROBE_BOARD_LED_BRIGHTNESS=16
CONFIG_SUPPORT_CLOSURE_CONTROL_CLUSTER=n
CONFIG_SUPPORT_CLOSURE_DIMENSION_CLUSTER=n
CONFIG_SUPPORT_WIFI_NETWORK_DIAGNOSTICS_CLUSTER=n
CONFIG_SUPPORT_WIFI_NETWORK_MANAGEMENT_CLUSTER=n
